using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Сортировка_массива__бинарная_сортировка
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //условие: написать сортировку массива, используя бинарное представление чисел,
            //сравнить в программе время ее выполнения с сортировкой деревом и пузырьком на разных 
            //длинах массивов(1,5,20,1000 целочисленных элементов)

            //1. что такое сортировка массива?
            //2. бинарное представление в c#
            //3. сортировка деревом
            //4. сортировка пузырьком
            //5. как сравнить в программе время ее выполнения?
            //6. сравнить время выполнения программы на разных длинах массивов.



        }
    }
}
